SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_pcnt.h
/* Bit fields for PCNT EN */
#define _PCNT_EN_RESETVALUE                     0x00000000UL                            /**< Default value for PCNT_EN                   */
#define _PCNT_EN_MASK                           0x00000003UL                            /**< Mask for PCNT_EN                            */
#define PCNT_EN_EN                              (0x1UL << 0)                            /**< PCNT Module Enable                          */
#define _PCNT_EN_EN_SHIFT                       0                                       /**< Shift value for PCNT_EN                     */
#define _PCNT_EN_EN_MASK                        0x1UL                                   /**< Bit mask for PCNT_EN                        */
#define _PCNT_EN_EN_DEFAULT                     0x00000000UL                            /**< Mode DEFAULT for PCNT_EN                    */
#define PCNT_EN_EN_DEFAULT                      (_PCNT_EN_EN_DEFAULT << 0)              /**< Shifted mode DEFAULT for PCNT_EN            */
#define PCNT_EN_DISABLING                       (0x1UL << 1)                            /**< Disablement busy status                     */
#define _PCNT_EN_DISABLING_SHIFT                1                                       /**< Shift value for PCNT_DISABLING              */
#define _PCNT_EN_DISABLING_MASK                 0x2UL                                   /**< Bit mask for PCNT_DISABLING                 */
#define _PCNT_EN_DISABLING_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for PCNT_EN                    */
#define PCNT_EN_DISABLING_DEFAULT               (_PCNT_EN_DISABLING_DEFAULT << 1)       /**< Shifted mode DEFAULT for PCNT_EN            */

/* Bit fields for PCNT SWRST */
#define _PCNT_SWRST_RESETVALUE                  0x00000000UL                            /**< Default value for PCNT_SWRST                */
#define _PCNT_SWRST_MASK                        0x00000003UL                            /**< Mask for PCNT_SWRST                         */
#define PCNT_SWRST_SWRST                        (0x1UL << 0)                            /**< Software reset command                      */
#define _PCNT_SWRST_SWRST_SHIFT                 0                                       /**< Shift value for PCNT_SWRST                  */
#define _PCNT_SWRST_SWRST_MASK                  0x1UL                                   /**< Bit mask for PCNT_SWRST                     */
#define _PCNT_SWRST_SWRST_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for PCNT_SWRST                 */
#define PCNT_SWRST_SWRST_DEFAULT                (_PCNT_SWRST_SWRST_DEFAULT << 0)        /**< Shifted mode DEFAULT for PCNT_SWRST         */
#define PCNT_SWRST_RESETTING                    (0x1UL << 1)                            /**< Software reset busy status                  */
#define _PCNT_SWRST_RESETTING_SHIFT             1                                       /**< Shift value for PCNT_RESETTING              */
#define _PCNT_SWRST_RESETTING_MASK              0x2UL                                   /**< Bit mask for PCNT_RESETTING                 */
#define _PCNT_SWRST_RESETTING_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for PCNT_SWRST                 */
#define PCNT_SWRST_RESETTING_DEFAULT            (_PCNT_SWRST_RESETTING_DEFAULT << 1)    /**< Shifted mode DEFAULT for PCNT_SWRST         */

/* Bit fields for PCNT CFG */
#define _PCNT_CFG_RESETVALUE                    0x00000000UL                            /**< Default value for PCNT_CFG                  */
#define _PCNT_CFG_MASK                          0x00000377UL                            /**< Mask for PCNT_CFG                           */
#define _PCNT_CFG_MODE_SHIFT                    0                                       /**< Shift value for PCNT_MODE                   */
#define _PCNT_CFG_MODE_MASK                     0x7UL                                   /**< Bit mask for PCNT_MODE                      */
#define _PCNT_CFG_MODE_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for PCNT_CFG                   */
#define _PCNT_CFG_MODE_OVSSINGLE                0x00000000UL                            /**< Mode OVSSINGLE for PCNT_CFG                 */
#define _PCNT_CFG_MODE_EXTCLKSINGLE             0x00000001UL                            /**< Mode EXTCLKSINGLE for PCNT_CFG              */
#define _PCNT_CFG_MODE_EXTCLKQUAD               0x00000002UL                            /**< Mode EXTCLKQUAD for PCNT_CFG                */
#define _PCNT_CFG_MODE_OVSQUAD1X                0x00000003UL                            /**< Mode OVSQUAD1X for PCNT_CFG                 */
#define _PCNT_CFG_MODE_OVSQUAD2X                0x00000004UL                            /**< Mode OVSQUAD2X for PCNT_CFG                 */
#define _PCNT_CFG_MODE_OVSQUAD4X                0x00000005UL                            /**< Mode OVSQUAD4X for PCNT_CFG                 */
#define PCNT_CFG_MODE_DEFAULT                   (_PCNT_CFG_MODE_DEFAULT << 0)           /**< Shifted mode DEFAULT for PCNT_CFG           */
#define PCNT_CFG_MODE_OVSSINGLE                 (_PCNT_CFG_MODE_OVSSINGLE << 0)         /**< Shifted mode OVSSINGLE for PCNT_CFG         */
#define PCNT_CFG_MODE_EXTCLKSINGLE              (_PCNT_CFG_MODE_EXTCLKSINGLE << 0)      /**< Shifted mode EXTCLKSINGLE for PCNT_CFG      */
#define PCNT_CFG_MODE_EXTCLKQUAD                (_PCNT_CFG_MODE_EXTCLKQUAD << 0)        /**< Shifted mode EXTCLKQUAD for PCNT_CFG        */
#define PCNT_CFG_MODE_OVSQUAD1X                 (_PCNT_CFG_MODE_OVSQUAD1X << 0)         /**< Shifted mode OVSQUAD1X for PCNT_CFG         */
#define PCNT_CFG_MODE_OVSQUAD2X                 (_PCNT_CFG_MODE_OVSQUAD2X << 0)         /**< Shifted mode OVSQUAD2X for PCNT_CFG         */
#define PCNT_CFG_MODE_OVSQUAD4X                 (_PCNT_CFG_MODE_OVSQUAD4X << 0)         /**< Shifted mode OVSQUAD4X for PCNT_CFG         */
#define PCNT_CFG_DEBUGHALT                      (0x1UL << 4)                            /**< Debug Mode Halt Enable                      */
#define _PCNT_CFG_DEBUGHALT_SHIFT               4                                       /**< Shift value for PCNT_DEBUGHALT              */
#define _PCNT_CFG_DEBUGHALT_MASK                0x10UL                                  /**< Bit mask for PCNT_DEBUGHALT                 */
#define _PCNT_CFG_DEBUGHALT_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for PCNT_CFG                   */
#define _PCNT_CFG_DEBUGHALT_DISABLE             0x00000000UL                            /**< Mode DISABLE for PCNT_CFG                   */
#define _PCNT_CFG_DEBUGHALT_ENABLE              0x00000001UL                            /**< Mode ENABLE for PCNT_CFG                    */
#define PCNT_CFG_DEBUGHALT_DEFAULT              (_PCNT_CFG_DEBUGHALT_DEFAULT << 4)      /**< Shifted mode DEFAULT for PCNT_CFG           */
#define PCNT_CFG_DEBUGHALT_DISABLE              (_PCNT_CFG_DEBUGHALT_DISABLE << 4)      /**< Shifted mode DISABLE for PCNT_CFG           */
#define PCNT_CFG_DEBUGHALT_ENABLE               (_PCNT_CFG_DEBUGHALT_ENABLE << 4)       /**< Shifted mode ENABLE for PCNT_CFG            */
#define PCNT_CFG_FILTEN                         (0x1UL << 5)                            /**< Enable Digital Pulse Width Filter           */
#define _PCNT_CFG_FILTEN_SHIFT                  5                                       /**< Shift value for PCNT_FILTEN                 */
#define _PCNT_CFG_FILTEN_MASK                   0x20UL                                  /**< Bit mask for PCNT_FILTEN                    */
#define _PCNT_CFG_FILTEN_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for PCNT_CFG                   */
#define PCNT_CFG_FILTEN_DEFAULT                 (_PCNT_CFG_FILTEN_DEFAULT << 5)         /**< Shifted mode DEFAULT for PCNT_CFG           */
#define PCNT_CFG_HYST                           (0x1UL << 6)                            /**< Enable Hysteresis                           */
#define _PCNT_CFG_HYST_SHIFT                    6                                       /**< Shift value for PCNT_HYST                   */
#define _PCNT_CFG_HYST_MASK                     0x40UL                                  /**< Bit mask for PCNT_HYST                      */
#define _PCNT_CFG_HYST_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for PCNT_CFG                   */
#define PCNT_CFG_HYST_DEFAULT                   (_PCNT_CFG_HYST_DEFAULT << 6)           /**< Shifted mode DEFAULT for PCNT_CFG           */
#define PCNT_CFG_S0PRSEN                        (0x1UL << 8)                            /**< S0IN PRS Enable                             */
#define _PCNT_CFG_S0PRSEN_SHIFT                 8                                       /**< Shift value for PCNT_S0PRSEN                */
#define _PCNT_CFG_S0PRSEN_MASK                  0x100UL                                 /**< Bit mask for PCNT_S0PRSEN                   */
#define _PCNT_CFG_S0PRSEN_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for PCNT_CFG                   */
#define PCNT_CFG_S0PRSEN_DEFAULT                (_PCNT_CFG_S0PRSEN_DEFAULT << 8)        /**< Shifted mode DEFAULT for PCNT_CFG           */
#define PCNT_CFG_S1PRSEN                        (0x1UL << 9)                            /**< S1IN PRS Enable                             */
#define _PCNT_CFG_S1PRSEN_SHIFT                 9                                       /**< Shift value for PCNT_S1PRSEN                */
#define _PCNT_CFG_S1PRSEN_MASK                  0x200UL                                 /**< Bit mask for PCNT_S1PRSEN                   */
#define _PCNT_CFG_S1PRSEN_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for PCNT_CFG                   */
#define PCNT_CFG_S1PRSEN_DEFAULT                (_PCNT_CFG_S1PRSEN_DEFAULT << 9)        /**< Shifted mode DEFAULT for PCNT_CFG           */

